STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_RfWithFlash/STM32_WPAN/App/app_ble.c
          /* USER CODE END ACI_L2CAP_CONNECTION_UPDATE_RESP_VSEVT_CODE */
          break;
        case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
          APP_DBG_MSG("\r\n\r** ACI_GAP_PROC_COMPLETE_VSEVT_CODE \n");
          /* USER CODE BEGIN ACI_GAP_PROC_COMPLETE_VSEVT_CODE */

          /* USER CODE END ACI_GAP_PROC_COMPLETE_VSEVT_CODE */
          break; /* ACI_GAP_PROC_COMPLETE_VSEVT_CODE */
#if(RADIO_ACTIVITY_EVENT != 0)
        case ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE:
          /* USER CODE BEGIN RADIO_ACTIVITY_EVENT*/
          BSP_LED_On(LED_GREEN);
          HW_TS_Start(BleApplicationContext.SwitchOffGPIO_timer_Id, (uint32_t)LED_ON_TIMEOUT);
          /* USER CODE END RADIO_ACTIVITY_EVENT*/
          break; /* RADIO_ACTIVITY_EVENT */
#endif
      }
      break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */

        default:
          /* USER CODE BEGIN ECODE_DEFAULT*/

          /* USER CODE END ECODE_DEFAULT*/
          break;
  }

  return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_Get_Server_Connection_Status(void)
{
  return BleApplicationContext.Device_Connection_Status;
}

static void FlashOperationProc( void )
{
  uint32_t first_secure_sector_idx;
  uint32_t loop1, loop2;
  uint64_t * p_data_flash;

  /**
   * The test is alternatively erasing/writing the last CFG_NBR_OF_FLASH_SECTOR_TO_PROCESS sectors on each SW3 button action
   * On the first button SW3 action, it erases all sectors
   * On the next button SW3 action, it writes all sectors
   * Etc...
   */

  /* Erase/Write in the last CFG_NBR_OF_FLASH_SECTOR_TO_PROCESS sectors */
  first_secure_sector_idx = (READ_BIT(FLASH->SFR, FLASH_SFR_SFSA) >> FLASH_SFR_SFSA_Pos);

  if(FlashOperationReq == FLASH_ERASE_REQ)
  {
    if(FlashProcessStatus == FLASH_PROCESS_FINISHED)
    {
      APP_DBG_MSG("\r\n\rSTART ERASING ALL SECTORS FROM %ld TO %ld\n", first_secure_sector_idx-CFG_NBR_OF_FLASH_SECTOR_TO_PROCESS, first_secure_sector_idx-1);
      FlashProcessStatus = FLASH_PROCESS_STARTED;
    }

    NbrOfSectorToBeErased = FD_EraseSectors(first_secure_sector_idx-NbrOfSectorToBeErased, NbrOfSectorToBeErased);

    if(NbrOfSectorToBeErased == 0)
    {
      FlashOperationReq = FLASH_WRITE_REQ;
      FlashProcessStatus = FLASH_PROCESS_FINISHED;
      NbrOfSectorToBeErased = CFG_NBR_OF_FLASH_SECTOR_TO_PROCESS;

      /****************** START TEST RESULT CHECK *********************************/
      /* Check all sectors have been erased */
      for(loop1 = 0; loop1 < CFG_NBR_OF_FLASH_SECTOR_TO_PROCESS; loop1++)
      {
        p_data_flash = (uint64_t*)(FLASH_BASE + ((loop1 + first_secure_sector_idx - CFG_NBR_OF_FLASH_SECTOR_TO_PROCESS)*FLASH_SECTOR_SIZE*1024));

        /* Check all data in the current sector have been erased */
        for(loop2 = 0; loop2 < (FLASH_SECTOR_SIZE*128); loop2++)
        {
          if((*p_data_flash) != (uint64_t)0xFFFFFFFFFFFFFFFF)
          {
            APP_DBG_MSG("\r\n\rERROR AT ADDRESS 0x%08lX \n", (uint32_t)p_data_flash);
            BSP_LED_On(LED_RED);
            /* Stop here code execution */
            while(1);
          }
          p_data_flash++;
        }
      }
      /****************** END TEST RESULT CHECK ***********************************/
      APP_DBG_MSG("\r\n\rALL SECTORS FROM %ld TO %ld HAVE BEEN SUCCESSFULLY ERASED\n", first_secure_sector_idx-CFG_NBR_OF_FLASH_SECTOR_TO_PROCESS, first_secure_sector_idx-1);
    }
    else
    {
      /**
       * There are still sectors to be erased
       * Request the background to run one more time the task
       */
      UTIL_SEQ_SetTask( 1<<CFG_TASK_FLASH_OPERATION_REQ_ID, CFG_SCH_PRIO_0);
    }
  }
  else
  {
    if(FlashProcessStatus == FLASH_PROCESS_FINISHED)
    {
      APP_DBG_MSG("\r\n\rSTART WRITING ALL SECTORS FROM %ld TO %ld\n", first_secure_sector_idx-CFG_NBR_OF_FLASH_SECTOR_TO_PROCESS, first_secure_sector_idx-1);
      FlashProcessStatus = FLASH_PROCESS_STARTED;
    }

    NbrOfDataToBeWritten = FD_WriteData(FLASH_BASE
                                        + ((first_secure_sector_idx - CFG_NBR_OF_FLASH_SECTOR_TO_PROCESS)*FLASH_SECTOR_SIZE*1024)
                                        + (((CFG_NBR_OF_FLASH_SECTOR_TO_PROCESS*512) - NbrOfDataToBeWritten)*8),
                                        FlashDataToWriteTab + (CFG_NBR_OF_FLASH_SECTOR_TO_PROCESS*512) - NbrOfDataToBeWritten,
                                        NbrOfDataToBeWritten);

    if(NbrOfDataToBeWritten == 0)
    {
      FlashOperationReq = FLASH_ERASE_REQ;
      FlashProcessStatus = FLASH_PROCESS_FINISHED;
      NbrOfDataToBeWritten = CFG_NBR_OF_FLASH_SECTOR_TO_PROCESS*512;

      /****************** START TEST RESULT CHECK *********************************/
      /* Check all sectors have been written */
      p_data_flash = (uint64_t*)(FLASH_BASE + ((first_secure_sector_idx - CFG_NBR_OF_FLASH_SECTOR_TO_PROCESS)*FLASH_SECTOR_SIZE*1024));
      for(loop1 = 0; loop1 < (CFG_NBR_OF_FLASH_SECTOR_TO_PROCESS*512); loop1++)
      {
        if((*p_data_flash) != FlashDataToWriteTab[loop1])
        {
          APP_DBG_MSG("\r\n\rERROR AT ADDRESS 0x%08lX \n", (uint32_t)p_data_flash);
          BSP_LED_On(LED_RED);
          /* Stop here code execution */
          while(1);
        }
        p_data_flash++;
      }
      /****************** END TEST RESULT CHECK ***********************************/

      APP_DBG_MSG("\r\n\rALL SECTORS FROM %ld TO %ld HAVE BEEN SUCCESSFULLY WRITTEN\n", first_secure_sector_idx-CFG_NBR_OF_FLASH_SECTOR_TO_PROCESS, first_secure_sector_idx-1);
    }
    else
    {
      /**
       * There are still data to be written
       * Request the background to run one more time the task
       */
      UTIL_SEQ_SetTask( 1<<CFG_TASK_FLASH_OPERATION_REQ_ID, CFG_SCH_PRIO_0);
    }
  }
  return;
}

/* USER CODE BEGIN FD*/
void APP_BLE_Key_Button1_Action(void)
{
  /**
   * There are two use cases that could be demonstrated:
   *
   * 1/
   * SW1 is pressed -> the notification is sent to the client and the timing protection is enabled
   * SW3 is pressed -> the task FlashOperationProc() is polling on Sem6 until SW1 is pressed again
   * SW1 is pressed -> the protection is disabled,
   *                   the task FlashOperationProc() resume and complete the test
   *                   the notification is sent to the client
   *
   *2/
   * SW3 is pressed -> the task FlashOperationProc() starts running the test
   * SW1 is pressed while FlashOperationProc() is running -> the timing protection is enabled
   *                                                         the task FlashOperationProc() is polling on Sem6 until SW1 is pressed again
   * SW1 is pressed -> the protection is disabled,
   *                   the task FlashOperationProc() resume and complete the test
   *                   the notification is sent to the client
   * Note: although SW1 is pressed twice, only one notification is sent to the client.
   * This is the correct behavior because the notification is not sent from the interrupt handler but from a background task.
   * As long as the CPU is looping into FlashOperationProc(), this background task is not executed.
   * This means that although the background task has been requested twice, it will run only once because the sequencer does not count
   * how many times a task has been requested.
   */
  if(TimingProtectionStatus == DISABLED)
  {
    TimingProtectionStatus = ENABLED;
    APP_DBG_MSG("\r\n\rCPU1 TIMING PROTECTION ENABLED\n");
    LL_HSEM_1StepLock(HSEM, CFG_HW_BLOCK_FLASH_REQ_BY_CPU1_SEMID);
  }
  else
  {
    TimingProtectionStatus = DISABLED;
    APP_DBG_MSG("\r\n\rCPU1 TIMING PROTECTION DISABLED\n");
    LL_HSEM_ReleaseLock(HSEM, CFG_HW_BLOCK_FLASH_REQ_BY_CPU1_SEMID, 0);
  }

  P2PS_APP_SW1_Button_Action();
}

void APP_BLE_Key_Button2_Action(void)
{
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0 )    
  UTIL_SEQ_SetTask( 1<<CFG_TASK_CONN_UPDATE_REG_ID, CFG_SCH_PRIO_0);
#endif

  return;
}

